******************************************************************
* サブルーチン
* 引数：顧客マスターテーブルの参照
* 顧客マスターテーブルの内容を顧客マスターテーブルにセットして呼び出し元に返す。
****************************************************************** 
 IDENTIFICATION              DIVISION.
 PROGRAM-ID.                 SUB01.
 ENVIRONMENT                 DIVISION.
 INPUT-OUTPUT                SECTION.
 FILE-CONTROL.
*顧客マスターファイル 
 SELECT  M1  ASSIGN  TO  "./M001.txt"
 ORGANIZATION IS LINE SEQUENTIAL
 ACCESS  MODE  IS  SEQUENTIAL.  
 DATA                        DIVISION.
 FILE                        SECTION.
*顧客マスターレコード
 FD  M1.
 01  M1R.
     05 CUST-CODE            PIC 9(04).
     05 CUST-NAME            PIC X(20).       
 WORKING-STORAGE             SECTION.
 01  END-FLG                 PIC 9(01).
* 添え字
 01 I                        PIC 9(02).
 01 RETURN-VALUE             PIC 9(02).  
 LINKAGE                     SECTION.
* 顧客マスターテーブル（引数）
 01 CUST-COUNT               PIC 9(02).        
 01 CUST-TABLE.
     05 CUSTOMER OCCURS 10 TIMES.
         10 CUST-CODE        PIC 9(04).
         10 CUST-NAME        PIC X(20).              

 PROCEDURE  DIVISION USING BY REFERENCE CUST-COUNT CUST-TABLE.
 PERFORM MAIN-RTN
*呼び出し元に返る
 GOBACK.
******************************************************************
* 顧客マスターテーブルの作成
******************************************************************
 MAIN-RTN.
*    変数の初期化
     INITIALIZE END-FLG CUST-COUNT 
*    ファイルオープン
     OPEN INPUT M1
*    顧客マスターの読み込み
     PERFORM UNTIL END-FLG > 0
         READ  M1 
             AT END
                 ADD 1 TO END-FLG
             NOT AT END
*                顧客マスターレコードをテーブルにセット            
                 ADD 1 TO CUST-COUNT 
                 MOVE CUST-CODE OF M1R 
                     TO CUST-CODE OF CUSTOMER(CUST-COUNT) 
                 MOVE CUST-NAME OF M1R 
                     TO CUST-NAME OF CUSTOMER(CUST-COUNT)  
         END-READ
     END-PERFORM
     MOVE 999 TO RETURN-CODE
*    ファイルオープン
     CLOSE M1.
 MAIN-RTN-EX. 
     STOP RUN.